Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: Available when Index conforms to Strideable, Indices is Range.Index>, and Index.Stride is Int.
ja: IndexがStrideableに準拠する、IndicesがRange.Index>である、そしてIndex.StrideがIntである時に利用可能です。

source: Available when RawValue conforms to FixedWidthInteger.
ja: RawValueがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when Scalar conforms to BinaryFloatingPoint and Scalar.RawSignificand conforms to FixedWidthInteger.
ja: ScalarがBinaryFloatingPointに準拠するそしてScalar.RawSignificandがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when Scalar conforms to Comparable.
ja: ScalarがComparableに準拠する場合に利用可能です。

source: Available when Scalar conforms to FixedWidthInteger.
ja: ScalarがFixedWidthIntegerに準拠する場合に利用可能です。

source: Available when Scalar conforms to FloatingPoint.
ja: ScalarがFloatingPointに準拠する場合に利用可能です。

source: Available when Base conforms to BidirectionalCollection and Base.Index conforms to Hashable.
ja: BaseがBidirectionalCollectionに準拠するそしてBase.IndexがHashableに準拠する時に利用可能です。

source: Available when Base conforms to BidirectionalCollection.
ja: BaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base conforms to Collection.
ja: BaseがCollectionに準拠する時に利用可能です。

source: Available when Base conforms to LazyCollectionProtocol and Base conforms to Collection.
ja: BaseがLazyCollectionProtocolに準拠するそしてBaseがCollectionに準拠する時に利用可能です。

source: Available when Base conforms to LazySequenceProtocol.
ja: BaseがLazySequenceProtocolに準拠する場合に利用可能です。

source: Available when Base.Element conforms to Comparable.
ja: Base.ElementがComparableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Equatable and Base conforms to BidirectionalCollection.
ja: Base.ElementがEquatableに準拠するそしてBaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base.Element conforms to Equatable and Base conforms to Collection.
ja: Base.ElementがEquatableに準拠するそしてBaseがCollectionに準拠する時に利用可能です。

source: Available when Base.Element conforms to Equatable.
ja: Base.ElementがEquatableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Sequence and Base conforms to LazySequenceProtocol.
ja: Base.ElementがSequenceに準拠するそしてBaseがLazySequenceProtocolに準拠する時に利用可能です。

source: Available when Base.Element conforms to Sequence.
ja: Base.ElementがSequenceに準拠する時に利用可能です。

source: Available when Base.Element conforms to StringProtocol.
ja: Base.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Base.Element is String and Base conforms to BidirectionalCollection.
ja: Base.ElementがStringであるそしてBaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base.Element is String.
ja: Base.ElementがStringである時に利用可能です。

source: Available when Base.Element.Element conforms to Comparable.
ja: Base.Element.ElementがComparableに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to Equatable.
ja: Base.Element.ElementがEquatableに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to Sequence.
ja: Base.Element.ElementがSequenceに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to StringProtocol.
ja: Base.Element.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Base.Index conforms to Strideable, Base.Indices is Range.Index>, Base.Index.Stride is Int, and Base conforms to RandomAccessCollection.
ja: Base.IndexがStrideableに準拠する、Base.IndicesがRange.Index>である、Base.Index.StrideがIntである、そしてBaseがRandomAccessCollectionに準拠する時に利用可能です。

source: Available when Base.Indices is DefaultIndicesMapSequence<Base, Element>> and Base conforms to Collection.
ja: Base.IndicesがDefaultIndicesMapSequence<Base, Element>>であるそしてBaseがCollectionに準拠する時に利用可能です。

source: Available when Base.Indices is DefaultIndicesSequence<Base>> and Base conforms to Collection.
ja: Base.IndicesがDefaultIndicesSequence<Base>>であるそしてBaseがCollectionに準拠する時に利用可能です。

source: Available when Bound conforms to BinaryInteger.
ja: BoundがBinaryIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Decodable.
ja: BoundがDecodableに準拠する時に利用可能。

source: Available when Bound conforms to Encodable.
ja: BoundがEncodableに準拠する時に利用可能。

source: Available when Bound conforms to Equatable, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがEquatableに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Hashable.
ja: BoundがHashableに準拠する時に利用可能です。

source: Available when Bound conforms to Sequence, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがSequenceに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Strideable and Bound.Stride conforms to SignedInteger.
ja: BoundがStrideableに準拠するそしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Strideable, Bound.Stride is Int, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがStrideableに準拠する、Bound.StrideがIntである、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to StringProtocol, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがStringProtocolに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound is AttributedString.Index.
ja: BoundがAttributedString.Indexである時に利用可能です。

source: Available when Bound is Date.
ja: BoundがDateである時に利用可能です。

source: Available when Bound is Int.
ja: BoundがIntである時に利用可能です。

source: Available when Bound is String, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがStringである、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound is String.Index.
ja: BoundがString.Indexである時に利用可能です。

source: Available when Element conforms to Decodable.
ja: ElementがDecodableに準拠する時に利用可能です。

source: Available when Element conforms to Encodable.
ja: ElementがEncodableに準拠する時に利用可能です。

source: Available when Element conforms to Equatable and Base conforms to BidirectionalCollection.
ja: ElementがEquatableに準拠するそしてBaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Element conforms to Equatable and Base conforms to Collection.
ja: ElementがEquatableに準拠するそしてBaseがCollectionに準拠する時に利用可能です。

source: Available when Element is AnyHashable.
ja: ElementがAnyHashableである時に利用可能です。

source: Available when Element is String and Base conforms to BidirectionalCollection.
ja: ElementがStringであるそしてBaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Element is UInt8.
ja: ElementがUInt8である時に利用可能です。

source: Available when Failure is Error.
ja: FailureがErrorである時に利用可能です。

source: Available when LazySequence<Base> is Base.
ja: LazySequenceが<Base>Baseである時に利用可能です。

source: Available when Never conforms to AnyObject.
ja: NeverがAnyObjectに準拠する時に利用可能です。

source: Available when PrefixSequence.Element conforms to Comparable.
ja: PrefixSequence.ElementがComparableに準拠する時に利用可能です。

source: Available when PrefixSequence.Element conforms to Equatable.
ja: PrefixSequence.ElementがEquatableに準拠する時に利用可能です。

source: Available when PrefixSequence.Element conforms to Sequence.
ja: PrefixSequence.ElementがSequenceに準拠する時に利用可能です。

source: Available when PrefixSequence.Element conforms to StringProtocol.
ja: PrefixSequence.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Scalar conforms to BinaryFloatingPoint.
ja: ScalarがBinaryFloatingPointに準拠する場合に利用可能です。

source: Available when Scalar is Double.
ja: ScalarがDoubleである時に利用可能です。

source: Available when Scalar is Float16.
ja: ScalarがFloat16である時に利用可能です。

source: Available when Scalar is Float.
ja: ScalarがFloatである時に利用可能です。

source: Available when Scalar is Int16.
ja: ScalarがInt16である時に利用可能です。

source: Available when Scalar is Int32.
ja: ScalarがInt32である時に利用可能です。

source: Available when Scalar is Int64.
ja: ScalarがInt64である時に利用可能です。

source: Available when Scalar is Int8.
ja: ScalarがInt8である時に利用可能です。

source: Available when Scalar is Int.
ja: ScalarがIntである時に利用可能です。

source: Available when Scalar is UInt16.
ja: ScalarがUInt16である時に利用可能です。

source: Available when Scalar is UInt32.
ja: ScalarがUInt32である時に利用可能です。

source: Available when Scalar is UInt64.
ja: ScalarがUInt64である時に利用可能です。

source: Available when Scalar is UInt8.
ja: ScalarがUInt8である時に利用可能です。

source: Available when Scalar is UInt.
ja: ScalarがUIntである時に利用可能です。

source: Available when Self conforms to AdditiveArithmetic and Scalar conforms to FloatingPoint.
ja: SelfがAdditiveArithmeticに準拠するそしてScalarがFloatingPointに準拠する時に利用可能です。

source: Available when Self conforms to BidirectionalCollection and Self is SubSequence.
ja: SelfがBidirectionalCollectionに準拠するそしてSelfがSubSequenceである時に利用可能です。

source: Available when Self conforms to BidirectionalCollection.
ja: SelfがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Bool.
ja: SelfがDecodableに準拠するそしてRawValueがBoolである時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Double.
ja: SelfがDecodableに準拠してRawValueがDoubleである時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Float.
ja: SelfがDecodableに準拠してRawValueがFloatである時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Int16.
ja: SelfがDecodableに準拠してRawValueがInt16である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Int32.
ja: SelfがDecodableに準拠してRawValueがInt32である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Int64.
ja: SelfがDecodableに準拠してRawValueがInt64である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Int8.
ja: SelfがDecodableに準拠してRawValueがInt8である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is Int.
ja: SelfがDecodableに準拠しRawValueがIntである時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is String.
ja: SelfがDecodableに準拠する、そしてRawValueがStringである時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is UInt16.
ja: SelfがDecodableに準拠してRawValueがUInt16である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is UInt32.
ja: SelfがDecodableに準拠してRawValueがUInt32である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is UInt64.
ja: SelfがDecodableに準拠してRawValueがUInt64である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is UInt8.
ja: SelfがDecodableに準拠してRawValueがUInt8である時に利用可能です。

source: Available when Self conforms to Decodable and RawValue is UInt.
ja: SelfがDecodableに準拠してRawValueがUIntである時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Bool.
ja: SelfがEncodableに準拠してRawValueがBoolである時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Double.
ja: SelfがEncodableに準拠してRawValueがDoubleである時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Float.
ja: SelfがEncodableに準拠してRawValueがFloatである時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Int16.
ja: SelfがEncodableに準拠してRawValueがInt16である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Int32.
ja: SelfがEncodableに準拠してRawValueがInt32である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Int64.
ja: SelfがEncodableに準拠してRawValueがInt64である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Int8.
ja: SelfがEncodableに準拠してRawValueがInt8である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is Int.
ja: SelfがEncodableに準拠してRawValueがIntである時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is String.
ja: SelfがEncodableに準拠してRawValueがStringである時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is UInt16.
ja: SelfがEncodableに準拠してRawValueがUInt16である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is UInt32.
ja: SelfがEncodableに準拠してRawValueがUInt32である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is UInt64.
ja: SelfがEncodableに準拠してRawValueがUInt64である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is UInt8.
ja: SelfがEncodableに準拠してRawValueがUInt8である時に利用可能です。

source: Available when Self conforms to Encodable and RawValue is UInt.
ja: SelfがEncodableに準拠してRawValueがUIntである時に利用可能です。

source: Available when Self conforms to FixedWidthInteger.
ja: SelfがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when Self conforms to Hashable and RawValue conforms to Hashable.
ja: SelfがHashableに準拠するそしてRawValueがHashableに準拠する時に利用可能です。

source: Available when Self conforms to MutableCollection.
ja: SelfがMutableCollectionに準拠する時に利用可能です。

source: Available when Self conforms to RandomAccessCollection and Element conforms to Comparable.
ja: SelfがRandomAccessCollectionに準拠するそしてElementがComparableに準拠する時に利用可能です。

source: Available when Self conforms to RandomAccessCollection.
ja: SelfがRandomAccessCollectionに準拠する時に利用可能です。

source: Available when Self is Element.
ja: SelfがElementである時に利用可能です。

source: Available when Self is Elements.
ja: SelfがElementsである時に利用可能です。

source: Available when Self is Iterator.
ja: SelfがIteratorである時に利用可能です。

source: Available when Self is SubSequence.
ja: SelfがSubSequenceである時に利用可能です。

source: Available when Success conforms to Equatable and Failure conforms to Equatable.
ja: SuccessがEquatableに準拠するそしてFailureがEquatableに準拠する時に利用可能です。

source: Available when Success conforms to Hashable and Failure conforms to Hashable.
ja: SuccessがHashableに準拠するそしてFailureがHashableに準拠する時に利用可能です。

source: Available when Wrapped conforms to Decodable.
ja: WrappedがDecodableに準拠する時に利用可能です。

source: Available when Wrapped conforms to DecodableWithConfiguration.
ja: WrappedがDecodableWithConfigurationに準拠する時に利用可能です。

source: Available when Wrapped conforms to Encodable.
ja: WrappedがEncodableに準拠する時に利用可能です。

source: Available when Wrapped conforms to EncodableWithConfiguration.
ja: WrappedがEncodableWithConfigurationに準拠する時に利用可能です。

source: Available when Wrapped conforms to Equatable.
ja: WrappedがEquatableに準拠する時に利用可能です。

source: Available when Wrapped conforms to Gesture.
ja: WrappedがGestureに準拠する場合に利用可能です。

source: Available when Wrapped conforms to Hashable.
ja: WrappedがHashableに準拠する時に利用可能です。

source: Available when Wrapped conforms to View.
ja: WrappedがViewに準拠する場合に利用可能です。

source: Basic Arithmetic
ja: 基本算術

source: Basic Behaviors
ja: 基本の挙動

source: Basic Collections
ja: 基本コレクション

source: Basic Values
ja: 基本的な値

source: Be aware, therefore, that general operations on LazyFilterCollection instances may not have the documented complexity.
ja: 自覚すべきは、したがって、LazyFilterCollectionインスタンス上での全体的な演算が複雑に記述されるものを持たないようにすることです。

source: Be aware, therefore, that general operations on lazy collections may not have the documented complexity.
ja: 自覚すべきは、したがって、遅延コレクション上での一般的な演算が複雑に記述されるものを持たないようにすることです。

source: Because Range represents a half-open range, a Range instance does not contain its upper bound.
ja: Rangeは半開範囲を表すことから、Rangeインスタンスはそれの上方の境界を含みません。

source: Because Swift provides several ways to safely unwrap optional values, you can choose the one that helps you write clear, concise code.
ja: Swiftは安全にオプショナル値をアンラップするために複数の方法を提供するので、あなたは明快な、簡潔なコードを記述する助けとしてその１つを選ぶことができます。

source: Because a PartialRangeFrom sequence counts upward indefinitely, do not use one with methods that read the entire sequence before returning, such as map(_:), filter(_:), or suffix(_:).
ja: PartialRangeFromシーケンスが上向きに無限に数えることから、返す前にシーケンス全体を読み出すメソッド、例えばmap(_:)、filter(_:)、またはsuffix(_:)などを持つものと一緒に使わないでください。

source: Because a half-open range does not include its upper bound, the ranges in the following example do not overlap:
ja: 半壊範囲はそれの上方の範囲を含まないことから、以下の例の範囲は重なりません：

source: Because a set is not an ordered collection, the “first” element may not be the first element that was added to the set.
ja: 集合は順序付けられたコレクションではないことから、「最初」の要素は集合に加えられた最初の要素ではないでしょう。

source: Because calling a closure can change the local and global state of your app, the code you write on the lines after passing a closure needs to be written with a careful consideration of when that closure is called.
ja: クロージャ呼び出しはあなたのアプリのローカルおよびグローバルな状態を変える可能性があることから、クロージャを渡す後の行であなたが書くコードは、いつそのクロージャが呼び出されるか注意深く考えて書かれる必要があります。

source: Because closures can contain code that interacts with multiple parts of an app, it's important to understand the different ways closures can be called by the APIs you pass them to.
ja: クロージャはアプリの複数の部分と相互作用するコードを含むことが可能なため、クロージャが、あなたがそれを渡す相手であるAPIによって呼び出される様々に異なる方法を理解するのは重要です。

source: Because enumerations define a finite number of states, and can bundle associated values with each individual state, you can use them to model the state of your app and its internal processes.
ja: 列挙がある有限の数の状態を定義する、そして個々の状態それぞれに関連値を束ねることから、あなたはそれらを使ってあなたのアプリの状態とそれの内部処理をモデル化できます。

source: Because floating-point types such as Float and Double are their own Stride types, they cannot be used as the bounds of a countable range.
ja: 浮動小数点型、例えばFloatおよびDoubleは、それら独自のStride型であるので、それらは可付番範囲の境界として使われることはできません。

source: Because of this, the index is always in-range and no trap can occur.
ja: このために、インデックスは常に範囲内です、そしてトラップは起こりえません。

source: Because structures in C can't have methods, property accessors, or custom initializers, you often need to write such functionality using global functions.
ja: Cでの構造体はメソッド、プロパティアクセッサ、またはあつらえのイニシャライザを持つことができないことから、あなたはしばしばそのような機能性をグローバル関数を使って書く必要があります。

source: Because the SignedNumeric protocol provides default implementations of both of its required methods, you don’t need to do anything beyond declaring conformance to the protocol and ensuring that the values of your type support negation.
ja: SignedNumericプロトコルはそれの必須メソッドの両方の省略時の実装を提供することから、あなたは、プロトコルへの準拠を宣言することおよびあなたの型の値が負をサポートするのを確実にすること以上に何もする必要はありません。

source: Because the Int8 type can represent 127 at maximum, the attempt to create z with a value of 1000 results in a runtime error.
ja: Int8型は、最大で127を表せることから、zを1000の値で作成する試みは、実行時エラーという結果になります。

source: Because this initializer does not perform any checks, it should be used as an optimization only when you are absolutely certain that lower is less than or equal to upper.
ja: このイニシャライザは何ら確認を行わないので、それは、あなたがlowerがupperより少ないか等しいことを絶対に確信している場合にのみ１つの最適化として使われるべきです。

source: Because you can’t subclass Swift classes in Objective-C, it’s best to choose a class in your app that doesn’t have any subclasses.
ja: あなたがスウィフトクラスをObjective-Cにおいてサブクラス化できないので、あなたのアプリにおいて全くサブクラスを持たないクラスを選択するのは最も良いことです。

source: Before shifting, the masking left shift operator masks the shift to this range.
ja: シフトする前に、マスク左シフト演算子は、シフトをマスクしてこの範囲にします。

source: Before shifting, the masking right shift operator masks the shift to this range.
ja: シフトする前に、マスク右シフト演算子は、シフトをマスクしてこの範囲にします。

source: Behind the scenes, Swift uses the animals array’s iterator to loop over the contents of the array.
ja: 舞台裏で、Swiftはanimals配列のもつイテレータを使って、その配列の要素のすべてにわたって繰り返します。

source: Besides maintaining the order of the original dictionary literal, KeyValuePairs also allows duplicates keys.
ja: 元の辞書リテラルの順番を保守するのと並んで、KeyValuePairsはまた重複キーを許可します。

source: Bits are randomly distributed so that every value of T is equally likely to be returned.
ja: それらビットは無作為に分布します、それでTの全ての値は等しく返される可能性をもちます。

source: Both now(_:) and later(_:) accept a closure and call it, but later(_:) waits a couple seconds before calling its closure.
ja: now(_:)とlater(_:)の両方ともクロージャを受け取りそれを呼び出します、しかしlater(_:)はそれのクロージャを呼び出す前に２秒ほど待ちます。

source: Both kinds of availability specifier are also available in Objective-C.
ja: 両方の種類の利用可能性指定子はまた、Objective-Cにおいても役立てられます。

source: Both parameters must be valid indices of the collection and not equal to endIndex.
ja: 両方のパラメータは、このコレクションの有効なインデックスであり、endIndexと等しくない必要があります。

source: Both parameters must be valid indices of the collection that are not equal to endIndex.
ja: 両方のパラメータは、このコレクションの有効なインデックスで、endIndexと等しくない必要があります。

source: Bridging Between Set and NSSet
ja: SetとNSSetの間のブリッジ

source: Bridging from NSSet to Set first calls the copy(with:) method (- copyWithZone: in Objective-C) on the set to get an immutable copy and then performs additional Swift bookkeeping work that takes O(1) time.
ja: NSSetからSetへのブリッジは、最初にcopy(with:)メソッド（Objective-Cにおける- copyWithZone:）を集合上で呼び出すことで可変のコピーを取得して、それからO(1)時間をとる追加的なSwift簿記作業を実行します。

source: Bridging from Set to NSSet always takes O(1) time and space.
ja: SetからNSSetへのブリッジは、常にO(1)の時間と空間をとります。

source: Buffer Implementation
ja: Buffer 実装

source: By default, a collection conforms to the Sequence protocol by supplying IndexingIterator as its associated Iterator type.
ja: 初期状態で、あるコレクションはSequenceプロトコルに、IndexingIteratorをそれの関連Iterator型として提供することによって準拠します。

source: By default, most types in the standard library are hashable, including strings, numeric and Boolean types, enumeration cases without associated values, and even sets themselves.
ja: 初期状態で、標準ライブラリの中のほとんどの型はハッシュ化されています、文字列、数のおよびブールの型、関連値なしの列挙ケース節、そして集合それら自身さえも。

source: By default, the customMirror implementation of any ancestors is ignored.
ja: 初期状態では、あらゆる先祖のcustomMirror実装は無視されます。

source: C Interoperability
ja: C互換性

source: C and Objective-C Pointers
ja: CおよびObjective-Cポインタ

source: Calculates the result of shifting a value’s binary representation the specified number of digits to the right, masking the shift amount to the type’s bit width, and stores the result in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を計算します、シフト量をその型のもつビット幅にマスクしています、そして結果を左手側の変数に格納します。

source: Call body(p), where p is a pointer to the collection’s contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ隣接ストレージへのポインタです。

source: Call body(p), where p is a pointer to the collection’s mutable contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ可変の隣接ストレージへのポインタです。

source: Call body with UnsafeMutablePointers to the stored Header and raw Element storage.
ja: 格納HeaderおよびElement生ストレージそれぞれへのUnsafeMutablePointerを使ってbodyを呼び出します。

source: Call body with an UnsafeMutablePointer to the Element storage.
ja: ElementストレージへのUnsafeMutablePointerを使ってbodyを呼び出します。

source: Call body with an UnsafeMutablePointer to the stored Header.
ja: この格納HeaderへのUnsafeMutablePointerを使ってbodyを呼び出します。

source: Call randomElement() to select a random element from an array or another collection.
ja: randomElement()を呼び出して、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call randomElement(using:) to select a random element from an array or another collection when you are using a custom random number generator.
ja: randomElement(using:)を呼び出して、あなたがあつらえの無作為数生成子を使っている場合に、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call hasher.combine(_:) with each of these components.
ja: hasher.combine(_:)をそれら構成要素とともに呼び出してください。

source: Call the initializer that wraps a throwing expression when you need to serialize or memoize the result.
ja: スローする式をラップするイニシャライザを呼び出します、あなたが結果をシリアライズまたは記憶する必要がある時に。

source: Callers should apply the same preconditions to the return value as they would to a range provided directly by the user.
ja: 呼び出し側は、同じ前提条件を戻り値に適用すべきです、それらがユーザによって直接に提供される範囲にするように。

source: Calling flatMap(_:) on a sequence s is equivalent to calling s.map(transform).joined().
ja: flatMap(_:)をあるシーケンスs上で呼び出すことは、s.map(transform).joined()を呼び出すことに等しいです。

source: Calling swapAt(_:_:) with the same index as both i and j has no effect.
ja: swapAt(_:_:)をiとj両方で同じインデックスで呼び出すことは、効果を持ちません。

source: Calling Objective-C APIs Asynchronously
ja: Objective-C APIを非同期に呼び出す

source: Calling the getRed(red:green:blue:alpha:) method in Swift requires passing four in-out parameters.
ja: getRed(red:green:blue:alpha:)メソッドをSwiftにおいて呼び出すことは、インアウトパラメータを渡すことを必要とします。

source: Calling the reserveCapacity(_:) method on a set with bridged storage triggers a copy to contiguous storage even if the existing storage has room to store minimumCapacity elements.
ja: reserveCapacity(_:)メソッドをブリッジされたストレージを持つ集合で呼び出すことは、隣接ストレージへのコピーを引き起こします、たとえ既存のストレージにminimumCapacity要素を格納する余地があるとしてもです。
